/* datavar.rexx */
a = 5
b = 3
sum = a + b
diff = a - b
prod = a * b
quot = a / b

say "5 + 3 = " sum
say "5 - 3 = " diff
say "5 * 3 = " prod
say "5 / 3 = " quot
